export const rewrites = new Map([
  ['ـ', ''],
  ['َّ', 'َّ'],
  ['ُّ', 'ُّ'],
  ['ِّ', 'ِّ'],
  [',', ''],
  ['،', ''],
  ['ٰ', ''],
  ['الله', 'اللاه'],
  ['اللّه', 'اللاه'],
  ['اللَّه', 'اللاه'],
  ['لِلَّه', 'لللاه'],
  ['للَّه', 'لللاه'],
  ['لِلّه', 'لللاه'],
  ['للّه', 'لللاه'],
  ['لَكِن', 'لَاكِن'],
  ['لَكِنْ', 'لَاكِن'],
  ['لَكن', 'لَاكِن'],
  ['لكِن', 'لَاكِن'],
  ['لكن', 'لَاكِن'],
  ['هَذَا', 'هَاذَا'],
  ['هذا', 'هَاذَا'],
  ['هَذا', 'هَاذَا'],
  ['هَذِه', 'هَاذِه'],
  ['هذه', 'هَاذِه'],
  ['هَذه', 'هَاذِه'],
  ['هَذَان', 'هَاذَان'],
  ['هَذَانْ', 'هَاذَان'],
  ['هّذان', 'هَاذَان'],
  ['هَؤُلَاء', 'هَاؤُلَاء'],
  ['هَؤُلَاءْ', 'هَاؤُلَاء'],
  ['هَؤلاء', 'هَاؤُلَاء'],
  ['هؤلاء', 'هَاؤُلَاء'],
  ['هَذِي', 'هَاذِي'],
  ['هَذي', 'هَاذِي'],
  ['هذي', 'هَاذِي'],
  ['اَ', ''],
  ['اِ', ''],
  ['اُ', ''],
  ['اْ', ''],
  ['اّ', ''],
  [' َ', 'َ'],
  [' ِ', 'ِ'],
  [' ُ', 'ُ'],
  ['\r', ''],
]);

export const normalize = (shatr) => {
  let result = shatr;
  for (const [pattern, replacement] of rewrites) {
    result = result.replaceAll(pattern, replacement);
  }
  return result;
};
